apache/nuttx/arch/mips/src/pic32mz/pic32mz_spi.c
/****************************************************************************
 * arch/mips/src/pic32mz/pic32mz_spi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/spi.h>

#include "mips_internal.h"
#include "hardware/pic32mz_spi.h"
#include "hardware/pic32mz_pps.h"
#include "pic32mz_spi.h"
#include "pic32mz_dma.h"

#ifdef CONFIG_PIC32MZ_SPI

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* All SPI peripherals are clocked by PBCLK2 */

#define BOARD_PBCLOCK BOARD_PBCLK2

#ifdef CONFIG_PIC32MZ_SPI_DMA

/* When SPI DMA is enabled, small DMA transfers will still be performed by
 * polling logic. But we need a threshold value to determine what is small.
 * That value is provided by CONFIG_PIC32MZ_SPI_DMATHRESHOLD.
 */

#  ifndef CONFIG_PIC32MZ_SPI_DMATHRESHOLD
#    define CONFIG_PIC32MZ_SPI_DMATHRESHOLD 4
#  endif

/* Default values for channels' priority */

#  ifndef CONFIG_PIC32MZ_SPI_DMA_RXPRIO
#    define CONFIG_PIC32MZ_SPI_DMA_RXPRIO 0
#  endif

#  ifndef CONFIG_PIC32MZ_SPI_DMA_TXPRIO
#    define CONFIG_PIC32MZ_SPI_DMA_TXPRIO 0
#  endif

/* DMA timeout. The value is not critical; we just don't want the system to
 * hang in the event that a DMA does not finish.
 */

#  define DMA_TIMEOUT_MS    (800)
#  define DMA_TIMEOUT_TICKS MSEC2TICK(DMA_TIMEOUT_MS)

#  ifdef CONFIG_PIC32MZ_SPI_DMADEBUG
#    define DMA_INITIAL      0
#    define DMA_AFTER_SETUP  1
#    define DMA_AFTER_START  2
#    define DMA_CALLBACK     3
#    define DMA_TIMEOUT      3
#    define DMA_END_TRANSFER 4
#    define DMA_NSAMPLES     5
#  endif

/* Default value for the DMA buffer size */

#  ifndef CONFIG_PIC32MZ_SPI_DMABUFFSIZE
#    define CONFIG_PIC32MZ_SPI_DMABUFFSIZE 256
#  endif

#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes the fixed (ROM-able) configuration of the SPI
 * peripheral.
 */

struct pic32mz_config_s
{
  uint32_t         base;       /* SPI register base address */
#if defined(CONFIG_PIC32MZ_SPI_INTERRUPTS) || defined (CONFIG_PIC32MZ_SPI_DMA)
  uint8_t          firq;       /* SPI fault interrupt number */
  uint8_t          rxirq;      /* SPI receive done interrupt number */
  uint8_t          txirq;      /* SPI transfer done interrupt number */
#endif
  uint8_t          sdipps;     /* SDI peripheral pin selection */
  uint8_t          sdopps;     /* SDO peripheral pin selection */
  uintptr_t        sdoreg;     /* SDO peripheral pin configuration register */
};

/* This structure describes the state of the SPI driver */

struct pic32mz_dev_s
{
  struct spi_dev_s spidev;     /* Externally visible part of the SPI interface */
  const struct pic32mz_config_s *config;
  mutex_t          lock;       /* Held while chip is selected for mutual exclusion */
  uint32_t         frequency;  /* Requested clock frequency */
  uint32_t         actual;     /* Actual clock frequency */
  uint8_t          mode;       /* Mode 0,1,2,3 */
  uint8_t          nbits;      /* Width of word in bits (8 to 16) */

#ifdef CONFIG_PIC32MZ_SPI_DMA
  DMA_HANDLE rxdma;            /* SPI RX DMA handle */
  DMA_HANDLE txdma;            /* SPI TX DMA handle */
  int result;                  /* DMA result */
  sem_t dmawait;               /* Used to wait for DMA completion */
  struct wdog_s dmadog;        /* Watchdog that handles DMA timeouts */
#endif

#ifdef CONFIG_PIC32MZ_SPI_REGDEBUG
  bool             wrlast;     /* Last was a write */
  uint32_t         addrlast;   /* Last address */
  uint32_t         vallast;    /* Last value */
  int              ntimes;     /* Number of times */
#endif

#ifdef CONFIG_PIC32MZ_SPI_DMADEBUG
  struct pic32mz_dmaregs_s rxdmaregs[DMA_NSAMPLES];
  struct pic32mz_dmaregs_s txdmaregs[DMA_NSAMPLES];
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Low-level register access */

#ifdef CONFIG_PIC32MZ_SPI_REGDEBUG
static bool     spi_checkreg(struct pic32mz_dev_s *priv,
                  uintptr_t regaddr, uint32_t regvaql, bool wr);
static uint32_t spi_getreg(struct pic32mz_dev_s *priv,
                  unsigned int offset);
static void     spi_putaddr(struct pic32mz_dev_s *priv,
                  uintptr_t regaddr, uint32_t value);
#else
static inline uint32_t spi_getreg(struct pic32mz_dev_s *priv,
                  unsigned int offset);
static inline void     spi_putaddr(struct pic32mz_dev_s *priv,
                  uintptr_t regaddr, uint32_t value);
#endif
static inline void spi_putreg(struct pic32mz_dev_s *priv,
                  unsigned int offset, uint32_t value);
static inline void spi_flush(struct pic32mz_dev_s *priv);

