apache/nuttx/arch/mips/src/pic32mz/pic32mz_spi.c
  /* Register values after DMA start */

  pic32mz_dma_dump(priv->txdma, &priv->txdmaregs[DMA_AFTER_START],
              "TX: After DMA Start");
  pic32mz_dma_dump(priv->rxdma, &priv->rxdmaregs[DMA_AFTER_START],
              "RX: After DMA Start");

  /* Register values at the time of the TX and RX DMA callbacks
   * -OR- DMA timeout.
   *
   * If the DMA timed out, then there will not be any RX DMA
   * callback samples.  There is probably no TX DMA callback
   * samples either, but we don't know for sure.
   */

  pic32mz_dma_dump(priv->txdma, &priv->txdmaregs[DMA_CALLBACK],
                   "TX: At DMA callback");

  /* Register values at the end of the DMA */

  if (priv->result == -ETIMEDOUT)
    {
      pic32mz_dma_dump(priv->rxdma, &priv->rxdmaregs[DMA_TIMEOUT],
                       "RX: At DMA timeout");
    }
  else
    {
      pic32mz_dma_dump(priv->rxdma, &priv->rxdmaregs[DMA_CALLBACK],
                       "RX: At DMA callback");
    }

  pic32mz_dma_dump(priv->txdma, &priv->txdmaregs[DMA_END_TRANSFER],
                   "TX: At End-of-Transfer");
  pic32mz_dma_dump(priv->rxdma, &priv->rxdmaregs[DMA_END_TRANSFER],
                   "RX: At End-of-Transfer");
}
#endif

/****************************************************************************
 * Name: spi_dmarxcallback
 *
 * Description:
 *   This callback function is invoked at the completion of the SPI RX DMA.
 *
 * Input Parameters:
 *   handle - The DMA handler
 *   status - The status of the DMA transfer
 *   arg - A pointer to the dev structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_PIC32MZ_SPI_DMA
static void spi_dmarxcallback(DMA_HANDLE handle, uint8_t status, void *arg)
{
  struct pic32mz_dev_s *priv = (struct pic32mz_dev_s *)arg;

  DEBUGASSERT(priv != NULL);

  /* Cancel the watchdog timeout */

  wd_cancel(&priv->dmadog);

  /* Sample DMA registers at the time of the callback */

  spi_rxdma_sample(priv, DMA_CALLBACK);

  /* Report the result of the transfer */

  if (status & PIC32MZ_DMA_INT_ADDRERR)
    {
      priv->result = -EFAULT;
    }
  else if (status & PIC32MZ_DMA_INT_ABORT)
    {
      priv->result = -ECONNABORTED;
    }
  else if (status & PIC32MZ_DMA_INT_BLOCKDONE)
    {
      priv->result = OK;
    }
  else
    {
      priv->result = -EIO;
    }

  /* Then wake up the waiting thread */

  nxsem_post(&priv->dmawait);
}
#endif /* CONFIG_PIC32MZ_SPI_DMA */

/****************************************************************************
 * Name: spi_dmatxcallback
 *
 * Description:
 *   This callback function is invoked at the completion of the SPI TX DMA.
 *
 * Input Parameters:
 *   handle - The DMA handler
 *   status - The status of the DMA transfer
 *   arg - A pointer to the dev structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_PIC32MZ_SPI_DMA
static void spi_dmatxcallback(DMA_HANDLE handle, uint8_t status, void *arg)
{
  struct pic32mz_dev_s *priv = (struct pic32mz_dev_s *)arg;
  DEBUGASSERT(priv != NULL);

  /* Cancel the watchdog timeout */

  wd_cancel(&priv->dmadog);

  /* Sample DMA registers at the time of the callback */

  spi_txdma_sample(priv, DMA_CALLBACK);

  /* Report the result of the transfer */

  if (status & PIC32MZ_DMA_INT_ADDRERR)
    {
      priv->result = -EFAULT;
    }
  else if (status & PIC32MZ_DMA_INT_ABORT)
    {
      priv->result = -ECONNABORTED;
    }
  else if (status & PIC32MZ_DMA_INT_BLOCKDONE)
    {
      priv->result = OK;
    }
  else
    {
      priv->result = -EIO;
    }

  /* Then wake up the waiting thread */

  nxsem_post(&priv->dmawait);
}
#endif /* CONFIG_PIC32MZ_SPI_DMA */

/****************************************************************************
 * Name: spi_dmatimeout
 *
 * Description:
 *   The watchdog timeout has expired without the completion of the DMA
 *   transfer.
 *
 * Input Parameters:
 *   arg    - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

#ifdef CONFIG_PIC32MZ_SPI_DMA
static void spi_dmatimeout(wdparm_t arg)
{
  struct pic32mz_dev_s *priv = (struct pic32mz_dev_s *)arg;
  DEBUGASSERT(priv != NULL);

  /* Sample DMA registers at the time of the timeout */

  spi_rxdma_sample(priv, DMA_CALLBACK);

  /* Report timeout result, perhaps overwriting any failure reports from
   * the TX callback.
   */

  priv->result = -ETIMEDOUT;

  /* Then wake up the waiting thread */

  nxsem_post(&priv->dmawait);
}
#endif /* CONFIG_PIC32MZ_SPI_DMA */

/****************************************************************************
 * Name: spi_exchange8
 *
 * Description:
 *   Exchange a block of 8-bit data from SPI.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nbytes   - the length of bytes that to be exchanged
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_exchange8(struct pic32mz_dev_s *priv,
                          const uint8_t *txbuffer, uint8_t *rxbuffer,
                          size_t nbytes)
{
  uint32_t regval;
  uint8_t data;

  spiinfo("nbytes: %d\n", nbytes);

  while (nbytes)
    {
      /* Write the data to be transmitted to the SPI Data Register */

      if (txbuffer)
        {
          data = *txbuffer++;
        }
      else
        {
          data = 0xaa;
        }

      spi_putreg(priv, PIC32MZ_SPI_BUF_OFFSET, (uint32_t)data);

#ifdef CONFIG_PIC32MZ_SPI_ENHBUF
      /* Wait for the SPIRBE bit in the SPI Status Register to be set to 0.
       * In enhanced buffer mode, the SPIRBE bit will be cleared in  when the
       * receive buffer is not empty.
       */

      while ((spi_getreg(priv, PIC32MZ_SPI_STAT_OFFSET) &
              SPI_STAT_SPIRBE) != 0);
#else
      /* Wait for the SPIRBF bit in the SPI Status Register to be set to 1.
       * In normal mode, the SPIRBF bit will be set when receive data is
       * available.
       */

      while ((spi_getreg(priv, PIC32MZ_SPI_STAT_OFFSET) &
              SPI_STAT_SPIRBF) == 0);
#endif

      /* Read from the buffer register to clear the status bit */

      regval = spi_getreg(priv, PIC32MZ_SPI_BUF_OFFSET);
      if (rxbuffer)
        {
          *rxbuffer++ = (uint8_t)regval;
        }
      else
        {
          UNUSED(regval);
        }

      nbytes--;
    }
}

/****************************************************************************
 * Name: spi_exchange16
 *
 * Description:
 *   Exchange a block of 16-bit data from SPI.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - the length of data that to be exchanged in units of words.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_exchange16(struct pic32mz_dev_s *priv,
                           const uint16_t *txbuffer,
                           uint16_t *rxbuffer, size_t nwords)
{
  uint32_t regval;
  uint16_t data;

  spiinfo("nwords: %d\n", nwords);
  while (nwords)
    {
      /* Write the data to transmitted to the SPI Data Register */

