apache/nuttx/arch/mips/src/pic32mz/pic32mz_spi.c
static void spi_setbits(struct spi_dev_s *dev, int nbits)
{
  struct pic32mz_dev_s *priv = (struct pic32mz_dev_s *)dev;
  uint32_t setting;
  uint32_t regval;

  /* Has the number of bits changed? */

  DEBUGASSERT(priv && nbits > 7 && nbits < 33);
  if (nbits != priv->nbits)
    {
      /* Yes... Set the CON register appropriately */

      if (nbits == 8)
        {
          setting = SPI_CON_MODE_8BIT;
        }
      else if (nbits == 16)
        {
          setting = SPI_CON_MODE_16BIT;
        }
      else if (nbits == 32)
        {
          setting = SPI_CON_MODE_32BIT;
        }
      else
        {
          spierr("ERROR: Unsupported nbits: %d\n", nbits);
          return;
        }

      regval  = spi_getreg(priv, PIC32MZ_SPI_CON_OFFSET);
      regval &= ~SPI_CON_MODE_MASK;
      regval |= setting;
      spi_putreg(priv, PIC32MZ_SPI_CON_OFFSET, regval);

      /* Save the selection so that subsequent re-configurations will be
       * faster.
       */

      priv->nbits = nbits;
    }
}

/****************************************************************************
 * Name: spi_send
 *
 * Description:
 *   Exchange one word on SPI
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   wd  - The word to send.  the size of the data is determined by the
 *         number of bits selected for the SPI interface.
 *
 * Returned Value:
 *   response
 *
 ****************************************************************************/

static uint32_t spi_send(struct spi_dev_s *dev, uint32_t wd)
{
  struct pic32mz_dev_s *priv = (struct pic32mz_dev_s *)dev;

  DEBUGASSERT(priv);

  /* Make sure that any previous transfer is flushed from the hardware */

  spi_flush(priv);

  if (priv->nbits > 8)
    {
      uint16_t txword;
      uint16_t rxword;

      /* spi_exchange16() can do this. */

      txword = wd;
      rxword = 0;
      spi_exchange16(priv, &txword, &rxword, 1);

      spiinfo("Sent %04x received %04x\n", txword, rxword);
      return (uint32_t)rxword;
    }
  else
    {
      uint8_t txbyte;
      uint8_t rxbyte;

      /* spi_exchange8() can do this. */

      txbyte = (uint8_t)wd;
      rxbyte = (uint8_t)0;
      spi_exchange8(priv, &txbyte, &rxbyte, 1);

      spiinfo("Sent %02x received %02x\n", txbyte, rxbyte);
      return (uint32_t)rxbyte;
    }
}

/****************************************************************************
 * Name: spi_exchange (and spi_exchange_nodma)
 *
 * Description:
 *   Exchange a block of data from SPI. There are two versions of this
 *   function:
 *      1- The first is enabled when CONFIG_PIC32MZ_SPI_DMA=y and performs
 *      DMA SPI transfers, but only when a large block of data is bieng
 *      transferred.
 *      2- The second does polled SPI transfers, however it is also used for
 *      short SPI transfers when CONFIG_PIC32MZ_SPI_DMA=y
 *      If CONFIG_PIC32MZ_SPI_DMA=n, only the second version is available.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - The length of data that to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.  If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits > 8 and <= 16, the data is
 *              packed into uint16_t's; if nbits > 16 the data is packed
 *              into uint32_t's.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_PIC32MZ_SPI_DMA
static void spi_exchange_nodma(struct spi_dev_s *dev,
                               const void *txbuffer,
                               void *rxbuffer, size_t nwords)
#else
static void spi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                         void *rxbuffer, size_t nwords)
#endif
{
  struct pic32mz_dev_s *priv = (struct pic32mz_dev_s *)dev;

  DEBUGASSERT(priv);

  /* Make sure that any previous transfer is flushed from the hardware */

  spi_flush(priv);

  if (priv->nbits > 8)
    {
      /* spi_exchange16() can do this. */

      spi_exchange16(priv, (const uint16_t *)txbuffer,
                     (uint16_t *)rxbuffer, nwords);
    }
  else
    {
      /* spi_exchange8() can do this. */

      spi_exchange8(priv, (const uint8_t *)txbuffer,
                    (uint8_t *)rxbuffer, nwords);
    }
}

#ifdef CONFIG_PIC32MZ_SPI_DMA
static void spi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                         void *rxbuffer, size_t nwords)
{
  struct pic32mz_dev_s *priv = (struct pic32mz_dev_s *)dev;
  struct pic32mz_dma_chcfg_s rxcfg;
  struct pic32mz_dma_chcfg_s txcfg;
  struct pic32mz_dma_xfrcfg_s rxxfr;
  struct pic32mz_dma_xfrcfg_s txxfr;
  uint8_t dummy[CONFIG_PIC32MZ_SPI_DMABUFFSIZE];
  uint32_t width;
  int ret;

  /* If we failed to allocate a DMA channel or this is a small transfer
   * then let spi_exchange_nodma() do the work.
   */

  if ((priv->rxdma == NULL) || (priv->txdma == NULL) ||
       nwords <= CONFIG_PIC32MZ_SPI_DMATHRESHOLD)
    {
      spiinfo("Non DMA transfer will be performed\n");
      spi_exchange_nodma(dev, txbuffer, rxbuffer, nwords);
      return;
    }

  spiinfo("txbuffer=%p rxbuffer=%p nwords=%d\n", txbuffer, rxbuffer, nwords);

  /* Make sure that any previous transfer is flushed from the hardware */

  spi_flush(priv);

  /* Sample initial DMA registers */

  spi_dma_sampleinit(priv);

  /* Select the number of bytes and the width of a cell transfer */

  if (priv->nbits > 8)
    {
      /* 16-bit transfer (2 bytes) */

      width  = 2;
    }
  else
    {
      /* 8-bit transfer (1 byte) */

      width  = 1;
    }

  /* Configure the DMA channels. There are four different cases:
   *
   * 1) A true exchange with the memory address incrementing on both
   *    RX and TX channels,
   * 2) A read operation with the memory address incrementing only on
   *    the receive channel,
   * 3) A write operation where the memory address increments only on
   *    the receive channel, and
   * 4) A corner case where the memory address does not increment
   *    on either channel. This case might be used in certain cases
   *    where you want to assure that certain number of clocks are
   *    provided on the SPI bus.
   */

  /* Do we have an RX buffer? */

  if (rxbuffer)
    {
      /* Yes, setup the DMA transfer with the RX buffer.
       * We need a DMA ISR for:
       *  1 - Block done: The DMA transfer has completed succuessfully.
       *  2 - Address error: An address error occurred during the transfer.
       *  3 - Transfer abort: Abort event occurred. (i.e. SPI Error)
       */

