apache/nuttx/arch/mips/src/pic32mz/pic32mz_spi.c
      rxcfg.priority = CONFIG_PIC32MZ_SPI_DMA_RXPRIO;
      rxcfg.startirq = priv->config->rxirq;
      rxcfg.abortirq = priv->config->firq;
      rxcfg.event    = PIC32MZ_DMA_INT_BLOCKDONE | PIC32MZ_DMA_INT_ADDRERR |
                       PIC32MZ_DMA_INT_ABORT;
      rxcfg.mode     = PIC32MZ_DMA_MODE_BASIC;

      rxxfr.srcaddr  = priv->config->base + PIC32MZ_SPI_BUF_OFFSET;
      rxxfr.destaddr = (uint32_t)rxbuffer;
      rxxfr.srcsize  = width;
      rxxfr.destsize = nwords;
      rxxfr.cellsize = width;
    }
  else
    {
      /* No RX buffer. Setup the DMA transfer with a dummy RX buffer.
       *
       *  In this case we don't need ISR events, TX side will handle the
       *  transfer.
       */

      rxcfg.priority = CONFIG_PIC32MZ_SPI_DMA_RXPRIO;
      rxcfg.startirq = priv->config->rxirq;
      rxcfg.abortirq = PIC32MZ_DMA_NOIRQ;
      rxcfg.event    = PIC32MZ_DMA_INT_DISABLE;
      rxcfg.mode     = PIC32MZ_DMA_MODE_BASIC;

      rxxfr.srcaddr  = priv->config->base + PIC32MZ_SPI_BUF_OFFSET;
      rxxfr.destaddr = (uint32_t)dummy;
      rxxfr.srcsize  = width;
      rxxfr.destsize = nwords;
      rxxfr.cellsize = width;
    }

  /* Do we have a TX buffer? */

  if (txbuffer)
    {
      /* Yes, setup the DMA transfer with the TX buffer.
       * We need a DMA ISR for:
       *  1 - Block done: The DMA transfer has completed succuessfully.
       *  2 - Address error: An address error occurred during the transfer.
       *  3 - Transfer abort: Abort event occurred. (i.e. SPI Error)
       */

      txcfg.priority = CONFIG_PIC32MZ_SPI_DMA_TXPRIO;
      txcfg.startirq = priv->config->txirq;
      txcfg.abortirq = priv->config->firq;
      txcfg.event    = PIC32MZ_DMA_INT_BLOCKDONE | PIC32MZ_DMA_INT_ADDRERR |
                       PIC32MZ_DMA_INT_ABORT;
      txcfg.mode     = PIC32MZ_DMA_MODE_BASIC;

      txxfr.srcaddr  = (uint32_t)txbuffer;
      txxfr.destaddr = priv->config->base + PIC32MZ_SPI_BUF_OFFSET;
      txxfr.srcsize  = nwords;
      txxfr.destsize = width;
      txxfr.cellsize = width;
    }
  else
    {
      /* No TX buffer. Setup the DMA transfer with a dummy TX buffer.
       *
       *  In this case we don't need ISR events, RX side will handle the
       *  transfer.
       */

      txcfg.priority = CONFIG_PIC32MZ_SPI_DMA_TXPRIO;
      txcfg.startirq = priv->config->txirq;
      rxcfg.abortirq = PIC32MZ_DMA_NOIRQ;
      txcfg.event    = PIC32MZ_DMA_INT_DISABLE;
      txcfg.mode     = PIC32MZ_DMA_MODE_BASIC;

      txxfr.srcaddr  = (uint32_t)dummy;
      txxfr.destaddr = priv->config->base + PIC32MZ_SPI_BUF_OFFSET;
      txxfr.srcsize  = nwords;
      txxfr.destsize = width;
      txxfr.cellsize = width;
    }

  /* Configure the channels */

  ret = pic32mz_dma_chcfg(priv->rxdma, &rxcfg);
  if (ret < 0)
    {
      spierr("ERROR: RX transfer config failed: %d\n", ret);
      return;
    }

  ret = pic32mz_dma_chcfg(priv->txdma, &txcfg);
  if (ret < 0)
    {
      spierr("ERROR: RX transfer config failed: %d\n", ret);
      return;
    }

  /* Then setup the transfers */

  ret = pic32mz_dma_xfrsetup(priv->rxdma, &rxxfr);
  if (ret < 0)
    {
      spierr("ERROR: RX transfer setup failed: %d\n", ret);
      return;
    }

  spi_rxdma_sample(priv, DMA_AFTER_SETUP);

  ret = pic32mz_dma_xfrsetup(priv->txdma, &txxfr);
  if (ret < 0)
    {
      spierr("ERROR: TX transfer setup failed: %d\n", ret);
      return;
    }

  spi_txdma_sample(priv, DMA_AFTER_SETUP);

  /* Flush cache to physical memory */

  if (txbuffer)
    {
      up_flush_dcache((uintptr_t)txbuffer,
                      (uintptr_t)txbuffer + nwords);
    }
  else
    {
      up_flush_dcache((uintptr_t)dummy,
                      (uintptr_t)dummy + CONFIG_PIC32MZ_SPI_DMABUFFSIZE);
    }

  /* Start the DMA transfer */

  priv->result = -EBUSY;

  ret = pic32mz_dma_start(priv->rxdma, spi_dmarxcallback, priv);
  if (ret < 0)
    {
      spierr("ERROR: RX DMA start failed: %d\n", ret);
      return;
    }

  spi_rxdma_sample(priv, DMA_AFTER_START);

  ret = pic32mz_dma_start(priv->txdma, spi_dmatxcallback, priv);
  if (ret < 0)
    {
      spierr("ERROR: TX DMA start failed: %d\n", ret);
      return;
    }

  spi_txdma_sample(priv, DMA_AFTER_START);

  /* Wait for DMA completion. This is done in a loop because there may be
   * false alarm semaphore counts that cause nxsem_wait() not fail to wait
   * or to wake-up prematurely (for example due to the receipt of a signal).
   * We know that the DMA has completed when the result is anything other
   * that -EBUSY.
   */

  do
    {
      /* Start (or re-start) the watchdog timeout */

      ret = wd_start(&priv->dmadog, DMA_TIMEOUT_TICKS,
                     spi_dmatimeout, (wdparm_t)priv);
      if (ret < 0)
        {
          spierr("ERROR: wd_start failed: %d\n", ret);
        }

      /* Wait for the DMA to complete */

      ret = nxsem_wait(&priv->dmawait);

      /* Cancel the watchdog timeout */

      wd_cancel(&priv->dmadog);

      /* Check if we were awakened by an error of some kind. EINTR is not a
       * failure. It simply means that the wait was awakened by a signal.
       */

      if (ret < 0 && ret != -EINTR)
        {
          DEBUGPANIC();
          return;
        }

      /* We might be awakened before the wait is over due to
       * residual counts on the semaphore.  So, to handle, that case,
       * we loop until something changes the DMA result to any value other
       * than -EBUSY.
       */
    }
  while (priv->result == -EBUSY);

  /* Dump the sampled DMA registers */

  spi_dma_sampledone(priv);

  /* Make sure that the DMA is stopped (it will be stopped automatically
   * on normal transfers, but not necessarily when the transfer terminates
   * on an error condition).
   */

  pic32mz_dma_stop(priv->rxdma);
  pic32mz_dma_stop(priv->txdma);

  /* All we can do is complain if the DMA fails */

  if (priv->result < 0)
    {
      spierr("ERROR: DMA failed with result: %d\n", priv->result);
    }
  else
    {
      spiinfo("DMA Transfer success\n");
    }

  /* Force RAM re-read */

  if (rxbuffer)
    {
      up_invalidate_dcache((uintptr_t)rxbuffer,
                           (uintptr_t)rxbuffer + nwords);
    }
  else
    {
      up_invalidate_dcache((uintptr_t)dummy, (uintptr_t)dummy +
                           CONFIG_PIC32MZ_SPI_DMABUFFSIZE);
    }
}
#endif /* CONFIG_PIC32MZ_SPI_DMA */

/****************************************************************************
 * Name: spi_sndblock
 *
 * Description:
 *   Send a block of data on SPI
 *
 * Input Parameters:
 *   dev -    Device-specific state data
 *   buffer - A pointer to the buffer of data to be sent
 *   nwords - the length of data to send from the buffer in number of
 *            words.  The wordsize is determined by the number of
 *            bits-per-word selected for the SPI interface. If nbits <= 8,
 *            the data is packed into uint8_t's; if nbits > 8 and <= 16, the
 *            data is packed into uint16_t's; if nbits > 16 the data is
 *            packed into uint32_t's.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void spi_sndblock(struct spi_dev_s *dev, const void *buffer,
                         size_t nwords)
{
  /* spi_exchange() can do this. */

  spi_exchange(dev, buffer, NULL, nwords);
}
#endif

/****************************************************************************
 * Name: spi_recvblock
 *
 * Description:
 *   Revice a block of data from SPI
 *
 * Input Parameters:
 *   dev   -  Device-specific state data
 *   buffer - A pointer to the buffer in which to receive data
 *   nwords - the length of data that can be received in the buffer in
 *            number of words. The wordsize is determined by the number of
 *            bits-per-word selected for the SPI interface. If nbits <= 8,
 *            the data is  packed into uint8_t's; if nbits > 8 and <= 16, the
 *            data is packed into uint16_t's; if nbits > 16 the data is
 *            packed into uint32_t's.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void spi_recvblock(struct spi_dev_s *dev, void *buffer,
                          size_t nwords)
{
  /* spi_exchange() can do this. */

